app/controllers/set_controller.rb

  def show
    @query = Query.find(params[:id])
---
SELECT * FROM `queries` WHERE (`queries`.`id` = 4)

  def download_kml
    @query = Query.find(params[:id])
---
SELECT * FROM `queries` WHERE (`queries`.`id` = 4)